#+TITLE: Creating a site with Pelican and org-mode
#+DATE: 2014-05-26
#+CATEGORY: org-mode
#+PROPERTY: TAGS org-mode, pelican, elisp

Never one to pass up the opportunity for yak-shaving, I thought I'd
finally try to settle on a publishing platform for various notes and
other content that I have scattered about on the web. The repository
is [[https://github.com/nhoffman/borborygmi][on GitHub.]]

I much prefer to generate content in org-mode, but I just couldn't
manage to get org-publish to work as I wanted. When I learned that the
[[http://docs.getpelican.com/en/latest/index.html][Pelican]] static site generator could import html and saw [[http://msnyder.info/posts/2013/12/introducing-pelicorg/][another effort]]
to use the two together, I thought I'd give it a shot.

Pelican is pretty easy to get started with:

#+BEGIN_SRC sh :eval no
virtualenv borborygmi-env
source borborygmi-env/bin/activate
pip install pelican
pelican-quickstart
#+END_SRC

* org-mode integration

At a basic level, integration with org-mode is pretty simple: Pelican
can import html content with page metadata provided in the
header. Since I already have some tools for exporting org-mode from
the command line (the project is named [[https://github.com/nhoffman/org-export][org-export]]), it was pretty easy
to write a utility for this purpose.

#+BEGIN_SRC sh :results output
org-export pelican -h
#+END_SRC

The utility renders the just body of the page (leaving all of the
styling, etc to Pelican) and provides page metadata in the header, for
example:

#+BEGIN_SRC sh :results output
head ../content/getting-started.html
#+END_SRC

#+RESULTS:
#+begin_example
<html>
    <head>
        <title>Creating a site with Pelican and org-mode</title>
        <meta name="authors" content="Noah Hoffman">
        <meta name="date" content="2014-05-26">
        <meta name="category" content="org-mode">
        <meta name="tags" content="org-mode, pelican, elisp">
        <meta name="save_as" content="getting-started.html">
        <meta name="url" content="getting-started.html">
    </head>
#+end_example

Specifying "save_as" and "url" was more convenient than trying to
guess how Pelican would name the page.

The org-mode source for each post is compiled to html and placed in
pelican's =content= directory, where it is subsequently added to the
site using =pelican content=. I liked that compiling each org-mode
file to html is performed separately from rendering the content with
Pelican: the former step is relatively slow, and a build tool can
easily be used to render only pages that have changed (I use [[http://www.scons.org/][scons]]).

There were a couple of tricky bits, though.

